In [1]:
import pandas as pd
df = pd.read_csv("data.csv")

In [3]:
df["price_paid"].describe()

count      1000
unique      528
top       $3.73
freq          8
Name: price_paid, dtype: object

In [6]:
df.price_paid = df.price_paid.apply(lambda x: x.replace("$",""))
df.price_paid = df.price_paid.astype(float)

In [7]:
df["price_paid"].mean()

6.461930000000001

In [8]:
df["price_paid"].sum()

6461.93

In [9]:
df["price_paid"].min()

3.0

In [10]:
df["price_paid"].max()

10.0

In [13]:
df["country"].unique().tolist()

['Canada', 'United States', 'Morocco', 'France', nan]

In [14]:
df["country"].value_counts()

France           408
United States    333
Canada           161
Morocco           54
Name: country, dtype: int64

In [17]:
df["gender"].value_counts()

Female    493
Male      438
Name: gender, dtype: int64

In [18]:
df["gender"].value_counts(normalize=True)

Female    0.529538
Male      0.470462
Name: gender, dtype: float64

In [20]:
df.groupby("country").sum()

                   id  price_paid     tax
country
Canada          70365     1017.45  2160.0
France         214440     2619.61  5100.0
Morocco         26591      362.97   780.0
United States  168150     2183.67  4520.0

In [21]:
df.groupby("country").mean()

                       id  price_paid   tax
country
Canada         437.049689    6.319565  20.0
France         525.588235    6.420613  20.0
Morocco        492.425926    6.721667  20.0
United States  504.954955    6.557568  20.0

In [24]:
df.groupby("gender")["price_paid"].sum()

gender
Female    3165.26
Male      2833.61
Name: price_paid, dtype: float64

In [25]:
df.groupby(["gender","country"]).mean()

                              id  price_paid   tax
gender country
Female Canada         461.472973    6.419324  20.0
       France         512.648241    6.350352  20.0
       Morocco        479.925926    7.024815  20.0
       United States  487.282353    6.437118  20.0
Male   Canada         406.000000    6.117467  20.0
       France         534.928177    6.498950  20.0
       Morocco        483.652174    6.146957  20.0
       United States  525.284722    6.672500  20.0